# 1. Використовуйте list comprehension, щоб створити новий список, але додайте 6 до кожного елемента.
lst1 = [44, 54, 64, 74, 104]

lst2 = [i + 6 for i in lst1] # місце для відповіді

print(lst2)


# 2. Використовуючи list comprehension, побудуйте список із квадратів кожного елемента в списку.
lst3 = [2, 4, 6, 8, 10, 12, 14]

list4 = [i ** 2 for i in lst3] # місце для відповіді

print(list4)


# 3. Дано словник який складається з транспортних засобів та їх маси в кілограмах. Складіть список назв транспортних
# засобів вагою до 5000 кілограмів. У тому самому list comprehension зробіть імена ключів великими регістром.
car_dict = {"Sedan": 1500, "SUV": 2000, "Pickup": 2500, "Minivan": 1600, "Van": 2400, "Semi": 13600, "Bicycle": 7,
         "Motorcycle": 110}

list5 = [i.upper() for i in car_dict.keys() if car_dict[i] <= 5000] # місце для відповіді

print(list5)