# Створити set котрий приймає в себе наступний ряд: 1, 2, 3, 4, 5, 6, 7
_set1 = {1, 2, 3, 4, 5, 6, 7}

# Створити set котрий приймає в себе наступний ряд: 5, 6, 7, 8, 9, 10, 11
_set2 = {5, 6, 7, 8, 9, 10, 11}

# Розширити перший сет за допомогою коменди .add(0)
_set1.add(0)

# Виконати команду .intersection() на першому сеті передаючи в команду другий сет як аргумент, результат зберегти у нову змінну.
_set3 = _set1.intersection(_set2)

# Виконати команду .symmetric_difference() на першому сеті передаючи в команду другий сет як аргумент, результат зберегти у нову змінну.
_set4 = _set1.symmetric_difference(_set2)


print(_set1, _set2, _set3, _set4, sep='\n')
